% __ Ёк-€ ƒр-лин по L отн oтс на произв шаг h=L-L2, n>1 или m>1
% строго говор€ - это э-€ по 3-м произв. точкам, одна из к-х €вл т.отсечки
% ќтсечка не €вл ос. точкой за искл случа€ n=1, где Lot=Inf
% Lo ~= Inf,  Xo ~= 0
% X=(a*L+b)/(L-c). “—¬4-45
% Ѕаза экстрап = [L1 L2 Lo]
% массивами мб либо только один арг-т, либо все, тогда разм-ти их равны

function X = extDLo( X1,X2,Xo, L1,L2,Lo, L) 
L21 = L2-L1;     L1o = L1-Lo;  Lo2 = Lo-L2;  
a = (Lo-L).*L21;
b = (L2-L).*L1o; 
c = (L1-L).*Lo2;
D = a.*X1.*X2 + b.*X1.*Xo + c.*X2.*Xo;        
Z = -(a.*Xo + b.*X2 + c.*X1); 

%A = L21.*X2.*X1;   e = L21.*Xo;    
%B = L1o.*X1.*Xo;   f = L1o.*X2;    
%C = Lo2.*Xo.*X2;   g = Lo2.*X1;    
%D = A.*Lo+B.*L2+C.*L1-(A+B+C).*L;   
%Z = (e+f+g).*L-(e.*Lo+f.*L2+g.*L1); 

if  all(Z > 0), X = D./Z;      
else            X = NaN;  end    % s - singularity      

